# RbsPipeFittingLossMethodParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsPipeFittingLossMethodParam Property
ParameterTypeId Class See Also
---
"Loss Method"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsPipeFittingLossMethodParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsPipeFittingLossMethodParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsPipeFittingLossMethodParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace